{
  "backend/main.mo": "Defines the canister actor with catalog data, authorization mixin, order types, and a query to return a hardcoded catalog.",
  "backend/migration.mo": "Provides a migration module that initializes an empty orders map when upgrading from an old actor.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, tests, and confidence scores.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for build and documentation tooling.",
  "frontend/index.css": "Sets global Tailwind layers and OKLCH-based color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Wraps the application with React Query and cart providers and renders MainApp.",
  "frontend/src/components/BrandedHeader.tsx": "Displays the branded header with logo, navigation buttons, cart badge, and login button.",
  "frontend/src/components/CategoryTabs.tsx": "Renders responsive category tabs using shadcn/ui Tabs, forwarding selection changes to the parent.",
  "frontend/src/components/LoginButton.tsx": "Provides a sign‑in/sign‑out button using Internet Identity with loading states and cache clearing.",
  "frontend/src/components/RequireAuthGate.tsx": "Authentication gate that blocks children until Internet Identity login is complete or prompts user to sign in.",
  "frontend/src/features/cart/CartContext.tsx": "Provides cart state, persistence, and functions for adding, removing, and updating items.",
  "frontend/src/features/cart/cartMath.ts": "Utility functions for computing line totals, cart totals, and formatting those totals.",
  "frontend/src/features/cart/CartPage.tsx": "Renders the cart UI with item lists, quantity controls, totals, and navigation back to the catalog.",
  "frontend/src/features/cart/storage.ts": "Handles saving, loading, and clearing cart data in localStorage with bigint serialization.",
  "frontend/src/features/cart/types.ts": "Defines cart item and cart state types and provides a helper for generating item keys.",
  "frontend/src/features/cart/useCart.ts": "Hook for accessing the cart context, throwing an error if used outside the provider.",
  "frontend/src/features/catalog/catalog-price-xpath.regression.test.ts": "Empty test file placeholder.",
  "frontend/src/features/catalog/CatalogPage.tsx": "Displays catalog categories, search, item lists, and integrates cart actions and loading/error states.",
  "frontend/src/features/catalog/formatting.ts": "Formats bigint prices into fixed AED currency strings.",
  "frontend/src/features/catalog/useCatalogQuery.ts": "Fetches catalog data via react-query using the backend actor with retry and freshness settings.",
  "frontend/src/features/checkout/CheckoutPage.tsx": "Checkout form with validation, order submission, authentication gating, and cart clearing on success.",
  "frontend/src/features/checkout/checkoutTypes.ts": "Defines checkout form data shape and initial form values.",
  "frontend/src/features/orders/MyOrdersPage.tsx": "Displays the authenticated user's orders with loading, error, empty, and list states, and supports navigation to order details.",
  "frontend/src/features/orders/OrderConfirmationPage.tsx": "Shows a confirmation screen after an order is placed and provides navigation to My Orders or the catalog.",
  "frontend/src/features/orders/OrderDetailsPage.tsx": "Displays detailed information for a selected order, including items, address, and totals, with fallback if not found.",
  "frontend/src/features/orders/useMyOrdersQuery.ts": "Fetches the current user's orders using react-query, enabled when an authenticated actor is available.",
  "frontend/src/features/orders/usePlaceOrderMutation.ts": "Creates and submits an order from cart data and invalidates the orders query on success.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of the backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, exposing identity state, login, and logout controls.",
  "frontend/src/index.css": "Defines Tailwind setup and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with react-query and Internet Identity providers and loads global styles.",
  "frontend/src/MainApp.tsx": "Implements simple view-based navigation between catalog, cart, checkout, confirmation, and order pages via local state.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash), storing them in session storage, and clearing them, with URL values taking precedence.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with dark mode, custom colors, fonts, animations, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Tracks the project’s state, including features, requirements, and pending requests for a mobile-first laundry ordering application."
}