{
  "backend/main.mo": "Defines catalog data types and returns a static multi‑category laundry catalog via getCatalog().",
  "backend/migration.mo": "Contains a no‑op migration that returns the provided state unchanged.",
  "feature_evidence.json": "Feature evidence report linking a price‑update requirement to specific frontend files and tests.",
  "frontend-file-summaries.txt": "Text file listing short summaries of key frontend source files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the React application root and main entry script.",
  "frontend/src/App.tsx": "Root component rendering CatalogPage inside a full-height container.",
  "frontend/src/components/BrandedHeader.tsx": "Renders a header with logo, title, subtitle, and a faint background image.",
  "frontend/src/components/CategoryTabs.tsx": "Tab component for switching catalog categories using shadcn/ui Tabs.",
  "frontend/src/features/catalog/catalog-price-xpath.regression.test.ts": "Regression test placeholder for verifying catalog price rendering at a specific XPath.",
  "frontend/src/features/catalog/CatalogPage.tsx": "Main catalog UI with category selection, search, loading/error states, and item display.",
  "frontend/src/features/catalog/formatting.ts": "Formats bigint prices into 'AED {amount}.00' strings.",
  "frontend/src/features/catalog/useCatalogQuery.ts": "React Query hook fetching the latest catalog from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state and provides login and identity handling.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH-based CSS variables for light/dark themes and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors from CSS variables, plugins, typography, animations, and theme extensions.",
  "project_state.json": "Stores project metadata including feature state, requests, and project settings."
}