{
  "kind": "build_request",
  "title": "Add mobile-first online ordering flow for laundry services",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a mobile-first ordering flow that lets customers select laundry services from the existing catalog, set quantities per item, and review a cart with line totals and an order total before checkout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "create mobile application for same - laundry services so that customer can choose required laundry service and can order online"
        ]
      },
      "acceptanceCriteria": [
        "On mobile widths, each catalog item includes an obvious control to add/remove and adjust quantity (min 0).",
        "A cart view is accessible from the catalog UI and shows selected items, quantities, per-item total, and overall total in AED formatting consistent with existing catalog price display.",
        "If the cart is empty, checkout is disabled and the UI clearly indicates that the user must add at least one item."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a checkout screen that collects the minimum information needed to place a laundry order online: customer name, phone number, pickup address, optional delivery address (or a toggle for same-as-pickup), pickup date/time window, and order notes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "create mobile application for same - laundry services so that customer can choose required laundry service and can order online"
        ]
      },
      "acceptanceCriteria": [
        "Checkout form fields are validated (required: name, phone, pickup address, pickup date/time).",
        "User-facing validation and labels are in English.",
        "After successful submission, the user sees an order confirmation screen with an order ID and a summary of items and totals."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Require customers to authenticate with Internet Identity before placing an order, while still allowing unauthenticated users to browse the service catalog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "customer can choose required laundry service and can order online"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users can view categories, search, and prices.",
        "Attempting to proceed to place an order prompts the user to sign in using the existing Internet Identity integration.",
        "After login, the user returns to the checkout flow without losing cart contents."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add backend support for placing and viewing orders: define order data types, persist orders in canister state, and expose methods to create an order and list the authenticated caller’s orders.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "can order online"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a create order method that records: caller Principal, selected items (category + item name + unit price at time of order + quantity), totals, customer contact fields, addresses, pickup schedule, notes, status, and timestamps.",
        "Backend exposes a method to list orders for the calling Principal (most recent first).",
        "Order IDs are unique and stable across upgrades (e.g., monotonic counter stored in stable state)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add an “My Orders” area in the UI that shows the signed-in customer their order history and details (order ID, status, date, items, totals, pickup info).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "order online"
        ]
      },
      "acceptanceCriteria": [
        "A signed-in user can navigate to a list of their orders.",
        "Selecting an order shows full order detail (items, quantities, unit prices, totals, addresses, pickup schedule, notes, status).",
        "If the user has no orders, the UI shows a clear empty state in English."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Apply a coherent mobile-app-style visual theme across the ordering experience (catalog, cart, checkout, order confirmation, my orders) using a clean “fresh laundry” aesthetic with warm neutrals and teal accents, consistent spacing, and prominent primary actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "create mobile application for same - laundry services"
        ]
      },
      "acceptanceCriteria": [
        "Mobile layouts prioritize one-column flow, sticky/obvious primary actions (e.g., View Cart / Checkout), and touch-friendly controls.",
        "Typography, surfaces, and buttons look consistent across all new screens.",
        "No blue/purple-dominant palette is introduced (keep warm neutrals + teal)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files in frontend immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for all user-facing text.",
    "No third-party auth beyond Internet Identity.",
    "No external databases or non-Motoko backend services."
  ],
  "nonGoals": [
    "Building a native iOS/Android binary app (deliver a mobile-first web app UI within the existing React frontend).",
    "Online card payments integration (Stripe/other gateways).",
    "Real-time order tracking or push notifications.",
    "Admin/merchant dashboard for managing orders (unless requested later)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}